# -*- coding: utf-8 -*-
#
#  Copyright 2013 Grigoriy Kramarenko <root@rosix.ru>
#  
#  This program is free software; you can redistribute it and/or modify
#  it under the terms of the GNU General Public License as published by
#  the Free Software Foundation; either version 3 of the License, or
#  (at your option) any later version.
#  
#  This program is distributed in the hope that it will be useful,
#  but WITHOUT ANY WARRANTY; without even the implied warranty of
#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#  GNU General Public License for more details.
#  
#  You should have received a copy of the GNU General Public License
#  along with this program; if not, write to the Free Software
#  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
#  MA 02110-1301, USA.
#  
#  

from __future__ import unicode_literals

### Протокол работы ICL ###

VERSION = (1, 1) # 2012-05-28
__version__ = '%s.%s' % VERSION

__all__ = ('ICL_COMMANDS', 'BUGS', 'ICL_MODES', 'ICL_SUBMODES',
    'ICL_FLAGS', 'FP_FLAGS')

### Команды ICL ###
#                     Разрядность денежных величин
# Все суммы в данном разделе – целые величины, указанные в «мде». МДЕ –
# минимальная денежная единица. С 01.01.1998 в Российской Федерации 1 МДЕ
# равна 1 копейке (до 01.01.1998 1 МДЕ была равна 1 рублю).
#
#                       Формат передачи значений
# Все числовые величины передаются в двоичном формате, если не указано
# другое. Первым передается самый младший байт, последним самый старший
# байт.
#
# При передаче даты (3 байта) сначала передаѐтся число (1 байт – ДД),
# затем месяц (2 байта – ММ), и последним – год (1 байт – ГГ).
#
# При передаче времени (3 байта) первым байтом передаются часы (1 байт
# – ЧЧ), затем минуты (2 байта – ММ), и последними передаются секунды (1
# байт – СС).
#
#                          Ответы и коды ошибок
# Ответное сообщение содержит корректную информацию, если код ошибки
# (второй байт в ответном сообщении) 0.
# Если код ошибки не 0, передается только код команды и код
# ошибки – 2 байта.
#

ICL_COMMANDS = {
    0x21h: 'Изчистване на дисплея',
    0x23h: 'Показване на текст на долния ред на дисплея',
    0x26h: 'Отваряне на служебен бон',
    0x27h: 'Затваряне на служебен бон',
    0x29h: 'Програмиране на конфигурационните “ключета”'
    0x2Ah: 'Печатане на свободен текст в служебен бон',
    0x2Bh: 'Установяване на HEADER и FOOTER и опции на печат',
    0x2Ch: 'Придвжване на хартията',
    0x2Dh: 'Отрязване на хартията',
    0x2Fh: 'Показване на текст на долния ред на дисплея',
    0x30h: 'Отваряне на фискален (клиентски) бон',
    0x31h: 'Регистриране на продажба',
    0x32h: 'Данъчни ставки задавани през съответния период',
    0x33h: 'Междинна сума',
    0x34h: 'Регистриране на продажба и показване на дисплея',
    0x35h: 'Изчисляване на сбор (Total)',
    0x36h: 'Печатане на свободен текст във фискален бон',
    0x38h: 'Затваряне на фискален бон',
    0x39h: 'Информация за купувача в разхирена касова бележка (фактура)',
    0x3Ch: 'Прекратяване (анулиране) на фискален бон',
    0x3Dh: 'Установяване на дата и час',
    0x3Еh: 'Връщане на датата и часа',
    0x3Fh: 'Показване на датата и часа на дисплея',
    0x40h: 'Информация за последен фискален запис',
    0x41h: 'Информация за сумите за деня',
    0x42h: 'Задаване на допустим интервал номера на фактура',
    0x44h: 'Брой свободни полета във фискалната памет',
    0x45h: 'Дневен финансов отчет с или без нулиране',
    0x46h: 'Служебно въвеждане или извеждане',
    0x47h: 'Печат на диагностична информация',
    0x48h: 'Фискализация',
    0x49h: 'Детайлен отчет на фискалната памет по номер на запис',
    0x4Ah: 'Получаване на статусите',
    0x4Ch: 'Статус на фискалната транзакция',
    0x4Fh: 'Съкратен отчет на фискалната памет по дата на запис',
    0x50h: 'Издаване на звуков сигнал',
    0x53h: 'Установяване на десетични знаци, валута и разрешени данъчни ставки',
    0x54h: 'Печат на баркод',
    0x55h: 'Задаване на име на допълнителните типове плащане',
    0x56h: 'Връщане на датата на последния фискален запис',
    0x57h: 'Програмиране име на департамент',
    0x58h: 'Получаване на натрупаните суми за департамент',
    0x59h: 'Програмиране на производствената тестова област',
    0x5Ah: 'Връща диагностична информация',
    0x5Bh: 'Програмиране на индивидуален номер на принтера и номер на ФП',
    0x5Eh: 'Детайлен отчет  на фискалната памет по дата на запис',
    0x5Fh: 'Съкратен отчет на фискалната памет по номер на запис',
    0x61h: 'Връща данъчните ставки.',
    0x62h: 'Установяване на БУЛСТАТ',
    0x63h: 'Връща зададения БУЛСТАТ',
    0x64h: 'Показване на свободен текст на дисплея',
    0x65h: 'Задаване на операторска парола',
    0x66h: 'Задаване на име на оператор',
    0x67h: 'Информация за текущия бон',
    0x69h: 'Отчет по оператори',
    0x6Ah: 'Отваряне на чекмедже',
    0x6Bh: 'Дефиниране и отчитане на артикули ',
    0x6Ch: 'Разширен дневен финансов отчет (с разпечатка на артикулите).',
    0x6Dh: 'Печат на дублиращ бон',
    0x6Еh: 'Допълнителна информация за деня',
    0x6Fh: 'Отчет по артикули',
    0x70h: 'Получаване на информация за оператор',
    0x71h: 'Получаване номера на последния отпечатан документ',
    0x72h: 'Получаване на информация за фискален запис или период',
    0x73h: 'Програмиране на графично лого',
    0x74h: 'Четене на блок от фискалната памет',
    0x75h: 'Разширен дневен финансов отчет с печат на департаментите',
    0x76h: 'Разширен дневен отчет с разпечатка на департаментите и артикулите',
    0x78h: 'Поддръжка на електронна контролна лента',
    0x79h: 'Четене на блок от кодовата памет (фирмуера)',
    0x7Eh: 'Сервизно изтриване на електронната контролна лента',
    0x7Fh: 'Сервизен ресет на оперативната памет',
}

### Коды ошибок ###
# В первом параметре значений указывается источник возникновения ошибки:
# фискальная память (ФП), электронная контрольная лента защищѐнная
# (ЭКЛЗ) или сама ККТ.
BUGS = {
    0x00: ('ФП', 'Ошибок нет'),
    0x01: ('ФП', 'Неисправен накопитель ФП 1, ФП 2 или часы'),
    0x02: ('ФП', 'Отсутствует ФП 1'),
    0x03: ('ФП', 'Отсутствует ФП 2'),
    0x04: ('ФП', 'Некорректные параметры в команде обращения к ФП'),
    0x05: ('ФП', 'Нет запрошенных данных'),
    0x06: ('ФП', 'ФП в режиме вывода данных'),
    0x07: ('ФП', 'Некорректные параметры в команде для данной реализации ФП'),
    0x08: ('ФП', 'Команда не поддерживается в данной реализации ФП'),
    0x09: ('ФП', 'Некорректная длина команды'),
    0x0A: ('ФП', 'Формат данных не BCD'),
    0x0B: ('ФП', 'Неисправна ячейка памяти ФП при записи итога'),

    0x11: ('ФП', 'Не введена лицензия'),
    0x12: ('ФП', 'Заводской номер уже введен'),
    0x13: ('ФП', 'Текущая дата меньше даты последней записи в ФП'),
    0x14: ('ФП', 'Область сменных итогов ФП переполнена'),
    0x15: ('ФП', 'Смена уже открыта'),
    0x16: ('ФП', 'Смена не открыта'),
    0x17: ('ФП', 'Номер первой смены больше номера последней смены'),
    0x18: ('ФП', 'Дата первой смены больше даты последней смены'),
    0x19: ('ФП', 'Нет данных в ФП'),
    0x1A: ('ФП', 'Область перерегистраций в ФП переполнена'),
    0x1B: ('ФП', 'Заводской номер не введен'),
    0x1C: ('ФП', 'В заданном диапазоне есть поврежденная запись'),
    0x1D: ('ФП', 'Повреждена последняя запись сменных итогов'),
    0x1E: ('ФП', 'Область перерегистраций ФП переполнена'),
    0x1F: ('ФП', 'Отсутствует память регистров'),

    0x20: ('ФП', 'Переполнение денежного регистра при добавлении'),
    0x21: ('ФП', 'Вычитаемая сумма больше содержимого денежного регистра'),
    0x22: ('ФП', 'Неверная дата'),
    0x23: ('ФП', 'Нет записи активизации'),
    0x24: ('ФП', 'Область активизаций переполнена'),
    0x25: ('ФП', 'Нет активизации с запрашиваемым номером'),
    0x26: ('ФП', 'В ФП присутствует 3 или более битых записей сменных итогов'),
    0x27: ('ФП', 'Признак несовпадения КС, з/н, перерегистраций или активизаций'),

    0x2B: ('ККТ', 'Невозможно отменить предыдущую команду'),
    0x2C: ('ККТ', 'Обнулѐнная касса (повторное гашение невозможно)'),
    0x2D: ('ККТ', 'Сумма чека по секции меньше суммы сторно'),
    0x2E: ('ККТ', 'В ККТ нет денег для выплаты'),

    0x30: ('ККТ', 'ККТ заблокирован, ждет ввода пароля налогового инспектора'),

    0x32: ('ККТ', 'Требуется выполнение общего гашения'),
    0x33: ('ККТ', 'Некорректные параметры в команде'),
    0x34: ('ККТ', 'Нет данных'),
    0x35: ('ККТ', 'Некорректный параметр при данных настройках'),
    0x36: ('ККТ', 'Некорректные параметры в команде для данной реализации ККТ'),
    0x37: ('ККТ', 'Команда не поддерживается в данной реализации ККТ'),
    0x38: ('ККТ', 'Ошибка в ПЗУ'),
    0x39: ('ККТ', 'Внутренняя ошибка ПО ККТ'),
    0x3A: ('ККТ', 'Переполнение накопления по надбавкам в смене'),
    0x3B: ('ККТ', 'Переполнение накопления в смене'),
    0x3C: ('ККТ', 'ЭКЛЗ: неверный регистрационный номер'),
    0x3D: ('ККТ', 'Смена не открыта – операция невозможна'),
    0x3E: ('ККТ', 'Переполнение накопления по секциям в смене'),
    0x3F: ('ККТ', 'Переполнение накопления по скидкам в смене'),

    0x40: ('ККТ', 'Переполнение диапазона скидок'),
    0x41: ('ККТ', 'Переполнение диапазона оплаты наличными'),
    0x42: ('ККТ', 'Переполнение диапазона оплаты типом 2'),
    0x43: ('ККТ', 'Переполнение диапазона оплаты типом 3'),
    0x44: ('ККТ', 'Переполнение диапазона оплаты типом 4'),
    0x45: ('ККТ', 'Cумма всех типов оплаты меньше итога чека'),
    0x46: ('ККТ', 'Не хватает наличности в кассе'),
    0x47: ('ККТ', 'Переполнение накопления по налогам в смене'),
    0x48: ('ККТ', 'Переполнение итога чека'),
    0x49: ('ККТ', 'Операция невозможна в открытом чеке данного типа'),
    0x4A: ('ККТ', 'Открыт чек – операция невозможна'),
    0x4B: ('ККТ', 'Буфер чека переполнен'),
    0x4C: ('ККТ', 'Переполнение накопления по обороту налогов в смене'),
    0x4D: ('ККТ', 'Вносимая безналичной оплатой сумма больше суммы чека'),
    0x4E: ('ККТ', 'Смена превысила 24 часа'),
    0x4F: ('ККТ', 'Неверный пароль'),

    0x50: ('ККТ', 'Идет печать предыдущей команды'),
    0x51: ('ККТ', 'Переполнение накоплений наличными в смене'),
    0x52: ('ККТ', 'Переполнение накоплений по типу оплаты 2 в смене'),
    0x53: ('ККТ', 'Переполнение накоплений по типу оплаты 3 в смене'),
    0x54: ('ККТ', 'Переполнение накоплений по типу оплаты 4 в смене'),
    0x55: ('ККТ', 'Чек закрыт – операция невозможна'),
    0x56: ('ККТ', 'Нет документа для повтора'),
    0x57: ('ККТ', 'ЭКЛЗ: количество закрытых смен не совпадает с ФП'),
    0x58: ('ККТ', 'Ожидание команды продолжения печати'),
    0x59: ('ККТ', 'Документ открыт другим оператором'),
    0x5A: ('ККТ', 'Скидка превышает накопления в чеке'),
    0x5B: ('ККТ', 'Переполнение диапазона надбавок'),
    0x5C: ('ККТ', 'Понижено напряжение 24В'),
    0x5D: ('ККТ', 'Таблица не определена'),
    0x5E: ('ККТ', 'Некорректная операция'),
    0x5F: ('ККТ', 'Отрицательный итог чека'),

    0x60: ('ККТ', 'Переполнение при умножении'),
    0x61: ('ККТ', 'Переполнение диапазона цены'),
    0x62: ('ККТ', 'Переполнение диапазона количества'),
    0x63: ('ККТ', 'Переполнение диапазона отдела'),
    0x64: ('ККТ', 'ФП отсутствует'),
    0x65: ('ККТ', 'Не хватает денег в секции'),
    0x66: ('ККТ', 'Переполнение денег в секции'),
    0x67: ('ККТ', 'Ошибка связи с ФП'),
    0x68: ('ККТ', 'Не хватает денег по обороту налогов'),
    0x69: ('ККТ', 'Переполнение денег по обороту налогов'),
    0x6A: ('ККТ', 'Ошибка питания в момент ответа по I2C'),
    0x6B: ('ККТ', 'Нет чековой ленты'),
    0x6C: ('ККТ', 'Нет контрольной ленты'),
    0x6D: ('ККТ', 'Не хватает денег по налогу'),
    0x6E: ('ККТ', 'Переполнение денег по налогу'),
    0x6F: ('ККТ', 'Переполнение по выплате в смене'),

    0x70: ('ККТ', 'Переполнение ФП'),
    0x71: ('ККТ', 'Ошибка отрезчика'),
    0x72: ('ККТ', 'Команда не поддерживается в данном подрежиме'),
    0x73: ('ККТ', 'Команда не поддерживается в данном режиме'),
    0x74: ('ККТ', 'Ошибка ОЗУ'),
    0x75: ('ККТ', 'Ошибка питания'),
    0x76: ('ККТ', 'Ошибка принтера: нет импульсов с тахогенератора'),
    0x77: ('ККТ', 'Ошибка принтера: нет сигнала с датчиков'),
    0x78: ('ККТ', 'Замена ПО'),
    0x79: ('ККТ', 'Замена ФП'),
    0x7A: ('ККТ', 'Поле не редактируется'),
    0x7B: ('ККТ', 'Ошибка оборудования'),
    0x7C: ('ККТ', 'Не совпадает дата'),
    0x7D: ('ККТ', 'Неверный формат даты'),
    0x7E: ('ККТ', 'Неверное значение в поле длины'),
    0x7F: ('ККТ', 'Переполнение диапазона итога чека'),

    0x80: ('ККТ', 'Ошибка связи с ФП'),
    0x81: ('ККТ', 'Ошибка связи с ФП'),
    0x82: ('ККТ', 'Ошибка связи с ФП'),
    0x83: ('ККТ', 'Ошибка связи с ФП'),
    0x84: ('ККТ', 'Переполнение наличности'),
    0x85: ('ККТ', 'Переполнение по продажам в смене'),
    0x86: ('ККТ', 'Переполнение по покупкам в смене'),
    0x87: ('ККТ', 'Переполнение по возвратам продаж в смене'),
    0x88: ('ККТ', 'Переполнение по возвратам покупок в смене'),
    0x89: ('ККТ', 'Переполнение по внесению в смене'),
    0x8A: ('ККТ', 'Переполнение по надбавкам в чеке'),
    0x8B: ('ККТ', 'Переполнение по скидкам в чеке'),
    0x8C: ('ККТ', 'Отрицательный итог надбавки в чеке'),
    0x8D: ('ККТ', 'Отрицательный итог скидки в чеке'),
    0x8E: ('ККТ', 'Отрицательный итог скидки в чеке'),
    0x8F: ('ККТ', 'Касса не фискализирована'),

    0x90: ('ККТ', 'Поле превышает размер, установленный в настройках'),
    0x91: ('ККТ', 'Выход за границу поля печати при данных настройках шрифта'),
    0x92: ('ККТ', 'Наложение полей'),
    0x93: ('ККТ', 'Восстановление ОЗУ прошло успешно'),
    0x94: ('ККТ', 'Исчерпан лимит операций в чеке'),
    0x95: ('ЭКЛЗ', 'Неизвестная ошибка ЭКЛЗ'),

    0xA0: ('ККТ', 'Ошибка связи с ЭКЛЗ'),
    0xA1: ('ККТ', 'ЭКЛЗ отсутствует'),
    0xA2: ('ЭКЛЗ', 'ЭКЛЗ: Некорректный формат или параметр команды'),
    0xA3: ('ЭКЛЗ', 'Некорректное состояние ЭКЛЗ'),
    0xA4: ('ЭКЛЗ', 'Авария ЭКЛЗ'),
    0xA5: ('ЭКЛЗ', 'Авария КС в составе ЭКЛЗ'),
    0xA6: ('ЭКЛЗ', 'Исчерпан временной ресурс ЭКЛЗ'),
    0xA7: ('ЭКЛЗ', 'ЭКЛЗ переполнена'),
    0xA8: ('ЭКЛЗ', 'ЭКЛЗ: Неверные дата и время'),
    0xA9: ('ЭКЛЗ', 'ЭКЛЗ: Нет запрошенных данных'),
    0xAA: ('ЭКЛЗ', 'Переполнение ЭКЛЗ (отрицательный итог документа)'),

    0xB0: ('ККТ', 'ЭКЛЗ: Переполнение в параметре количество'),
    0xB1: ('ККТ', 'ЭКЛЗ: Переполнение в параметре сумма'),
    0xB2: ('ККТ', 'ЭКЛЗ: Уже активизирована'),

    0xC0: ('ККТ', 'Контроль даты и времени (подтвердите дату и время)'),
    0xC1: ('ККТ', 'ЭКЛЗ: суточный отчѐт с гашением прервать нельзя'),
    0xC2: ('ККТ', 'Превышение напряжения в блоке питания'),
    0xC3: ('ККТ', 'Несовпадение итогов чека и ЭКЛЗ'),
    0xC4: ('ККТ', 'Несовпадение номеров смен'),
    0xC5: ('ККТ', 'Буфер подкладного документа пуст'),
    0xC6: ('ККТ', 'Подкладной документ отсутствует'),
    0xC7: ('ККТ', 'Поле не редактируется в данном режиме'),
    0xC8: ('ККТ', 'Отсутствуют импульсы от таходатчика'),
    0xC9: ('ККТ', 'Перегрев печатающей головки'),
    0xCA: ('ККТ', 'Температура вне условий эксплуатации'),
}

blank_dict = {}
### Режимы ККТ ###
# Режим ККМ – одно из состояний ККМ, в котором она может находиться.
# Режимы ККМ описываются одним байтом: младший полубайт – номер режима,
# старший полубайт – битовое поле, определяющее статус режима (для режимов
# 8, 13 и 14).
# Номера и назначение режимов и статусов:
ICL_MODES = {
    0:  ('Принтер в рабочем режиме.', blank_dict),
    1:  ('Выдача данных.', blank_dict),
    2:  ('Открытая смена, 24 часа не кончились.', blank_dict),
    3:  ('Открытая смена, 24 часа кончились.', blank_dict),
    4:  ('Закрытая смена.', blank_dict),
    5:  ('Блокировка по неправильному паролю налогового инспектора.', blank_dict),
    6:  ('Ожидание подтверждения ввода даты.', blank_dict),
    7:  ('Разрешение изменения положения десятичной точки.', blank_dict),
    8:  ('Открытый документ:', {
            0:  'Продажа.',
            1:  'Покупка.',
            2:  'Возврат продажи.',
            3:  'Возврат покупки.'
        }),
    9:  ('Режим разрешения технологического обнуления. В этот режим ККМ '\
        'переходит по включению питания, если некорректна информация в '\
        'энергонезависимом ОЗУ ККМ.', blank_dict),
    10: ('Тестовый прогон.', blank_dict),
    11: ('Печать полного фис. отчета.', blank_dict),
    12: ('Печать отчёта ЭКЛЗ.', blank_dict),
    13: ('Работа с фискальным подкладным документом:', {
            0:  'Продажа (открыт).',
            1:  'Покупка (открыт).',
            2:  'Возврат продажи (открыт).',
            3:  'Возврат покупки (открыт).'
        }),
    14: ('Печать подкладного документа.', {
            0:  'Ожидание загрузки.',
            1:  'Загрузка и позиционирование.',
            2:  'Позиционирование.',
            3:  'Печать.',
            4:  'Печать закончена.',
            5:  'Выброс документа.',
            6:  'Ожидание извлечения.'
        }),
    15: ('Фискальный подкладной документ сформирован.', blank_dict),
}

### Подрежимы ККТ ###
# Подрежим ККТ – одно из состояний ККТ , в котором он может находиться.
# Номера и назначение подрежимов:
ICL_SUBMODES = {
    0:  'Бумага есть – ККТ не в фазе печати операции – может принимать '\
        'от хоста команды, связанные с печатью на том документе, датчик'\
        ' которого сообщает о наличии бумаги.',
    1:  'Пассивное отсутствие бумаги – ККТ не в фазе печати операции – '\
        'не принимает от хоста команды, связанные с печатью на том '\
        'документе, датчик которого сообщает об отсутствии бумаги.',
    2:  'Активное отсутствие бумаги – ККТ в фазе печати операции – '\
        'принимает только команды, не связанные с печатью. Переход из '\
        'этого подрежима только в подрежим 3.',
    3:  'После активного отсутствия бумаги – ККТ ждет команду '\
        'продолжения печати. Кроме этого принимает команды, не '\
        'связанные с печатью.',
    4:  'Фаза печати операции полных фискальных отчетов – ККТ не '\
        'принимает от хоста команды, связанные с печатью, кроме команды'\
        ' прерывания печати.',
    5:  'Фаза печати операции – ККТ не принимает от хоста команды, '\
        'связанные с печатью.',
}

### Флаги ККТ ###
ICL_FLAGS = {
    0:  'Рулон операционного журнала',
    1:  'Рулон чековой ленты',
    2:  'Верхний датчик подкладного документа',
    3:  'Нижний датчик подкладного документа',
    4:  'Положение десятичной точки',
    5:  'ЭКЛЗ',
    6:  'Оптический датчик операционного журнала',
    7:  'Оптический датчик чековой ленты',
    8:  'Рычаг термоголовки операционного журнала',
    9:  'Рычаг термоголовки чековой ленты',
    10: 'Крышка корпуса ФР',
    11: 'Денежный ящик',
    12: 'Отказ правого датчика принтера | Бумага на входе в презентер | Модель принтера',
    13: 'Отказ левого датчика принтера | Бумага на выходе из презентера',
    14: 'ЭКЛЗ почти заполнена',
    15: 'Увеличенная точность количества | Буфер принтера непуст',
}

### Флаги ФП ###
FP_FLAGS = {
    0: {0:'ФП 1 нет',                      1:'ФП 1 есть'},
    1: {0:'ФП 2 нет',                      1:'ФП 2 есть'},
    2: {0:'Лицензия не введена',           1:'Лицензия введена'},
    3: {0:'Переполнения ФП нет',           1:'Есть переполнение ФП'},
    4: {0:'Батарея ФП >80%',               1:'Батарея ФП <80%'},
    5: {0:'Последняя запись ФП испорчена', 1:'Последняя запись ФП корректна'},
    6: {0:'Смена в ФП закрыта',            1:'Смена в ФП открыта'},
    7: {0:'24 часа в ФП не кончились',     1:'24 часа в ФП кончились'},
}
